app/views/articles/_article.html.erb

    </h3>
    <% if article.tag_list.present? %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_id = 1) AND ("taggings".taggable_type = 'Article')) AND (taggings.context = 'tags' AND taggings.tagger_id IS NULL)