app/controllers/articles_controller.rb

  def search
    @articles = Article.search(params[:keyword])
---
SELECT "articles".* FROM "articles" WHERE (articles.title LIKE '%models%' OR articles.body LIKE '%models%')

  def show
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 4) LIMIT 1

  def edit
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("body", "created_at", "excerpt", "location", "published_at", "title", "updated_at", "user_id") VALUES ('blurgity', '2011-01-23 02:01:28.289352', 'where do I start...?', 'not sure', '2011-01-23 02:00:00.000000', 'Should I be more assertive?', '2011-01-23 02:01:28.289352', NULL)

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1
UPDATE "articles" SET "body" = 'attacked by corn I was suddenly surrounded...BY EARS OF CORN!!!!', "updated_at" = '2011-01-23 02:41:42.086753' WHERE ("articles"."id" = 7)

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 517600287) LIMIT 1
DELETE FROM "articles" WHERE ("articles"."id" = 517600287)

  def notify_friend()
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1