app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "body", "created_at", "email", "name", "updated_at") VALUES (1, 'how do I look?', '2011-01-24 16:35:17.482519', 'bb@vegas.com', 'Burt Bacharach', '2011-01-24 16:35:17.482519')
---
  def create
    @comment = @article.comments.new(params[:comment])
    if @comment.save

SELECT "articles".* FROM "articles" WHERE ("articles".user_id = 2) AND ("articles"."id" = 1) ORDER BY published_at DESC, title ASC LIMIT 1
SELECT "comments".* FROM "comments" WHERE ("comments".article_id = 1) AND ("comments"."id" = 2) LIMIT 1
DELETE FROM "comments" WHERE ("comments"."id" = 2)
---
  def destroy
    @article = current_user.articles.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy