app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "hashed_password", "updated_at") VALUES ('2011-01-24 15:09:09.687560', 'corn@thesilo.com', '8843d7f92416211de9ebb963ff4ce28125932878', '2011-01-24 15:09:09.687560')
---
  def create
    @user = User.new(params[:user])
    if @user.save